{
  "intents":
  [
    {"tag": "greeting",
      "patterns": ["Hi", "How are you", "Is anyone there?", "Hello", "Good day", "Whats up", "Hey", "greetings"],
      "responses": ["Hello, I am the Ukranian War Chatbot!", "Hi, what would you like to know about the war?", "Hi there, how can I help?"],
      "context_set": ""
    },
    {"tag": "goodbye",
      "patterns": ["cya", "See you later", "Goodbye", "I am Leaving", "Have a Good day", "bye", "cao", "see ya"],
      "responses": ["Sad to see you go :(", "Bye, let's hope this war ends soon!", "Goodbye!"],
      "context_set": ""
    },
    {"tag": "worldwide_effects",
      "patterns": ["how is the war affecting the world?", "shortage of food because of the war", "what happend to international trades?"],
      "responses": ["Ukrainian farmers have 20 million tonnes of grain they cannot get to international markets. Prices on the international market were high and rising every day so farmers held on to some of their stock, to sell later. Then Russia attacked."],
      "context_set": ""
    },
    {"tag": "beginning",
      "patterns": ["How did this war start?", "How did this war began?", "When did this war start?"],
      "responses": ["The Russo-Ukrainian War is an ongoing war between Russia (together with pro-Russian separatist forces) and Ukraine. It began in February 2014 following the Ukrainian Revolution of Dignity, and initially focused on the status of Crimea and the Donbas, internationally recognised as part of Ukraine. The first eight years of the conflict included the Russian annexation of Crimea (2014) and the war in Donbas (2014–present) between Ukraine and Russian-backed separatists, as well as naval incidents, cyberwarfare, and political tensions. Following a Russian military build-up on the Russia–Ukraine border from late 2021, the conflict expanded significantly when Russia launched a full-scale invasion of Ukraine on 24 February 2022."],
      "context_set": ""
    },
    {"tag": "alliances",
      "patterns": ["how other countries are helping ukraine?"],
      "responses": [" the beginning of Russia’s war in Ukraine, “there was a public sentiment that Nato was the strong force and the EU was only capable of expressing various different levels of concern. But war is always a test that takes the masks off."],
      "context_set": ""
    },
    {"tag": "latest_news",
      "patterns": ["what are the latest news about the war?"],
      "responses": ["As the fourth month dawns in the war in Ukraine, the battle has narrowed to a 75-mile-wide sliver of land in the heart of the eastern Donbas region, where Russia’s concentrated firepower and shortened supply lines are helping its forces make progress toward a handful of key cities."],
      "context_set": ""
    },
    {"tag": "russian_citizenship",
      "patterns": ["how is russia dealing with residents of occupied cities?"],
      "responses": ["President Vladimir Putin signs a decree accelerating the process for residents in the Kherson and Zaporizhzhia regions to acquire Russian passports and citizenship."],
      "context_set": ""
    },
    {"tag": "ukraine",
      "patterns": ["what is the situation of ukraine citizens?"],
      "responses": ["Ukrainian prosecutors identified eight Russians they said were responsible for the killing of a village mayor, her husband and son. An estimated 90% or more of Ukrainians are at risk of being pushed close to or below the poverty line, according to the United Nations Development Program."],
      "context_set": ""
    },
    {"tag": "background",
      "patterns": ["why did this war start?",  "why did russia attack ukraine?"],
      "responses": ["Armed conflict in eastern Ukraine erupted in early 2014 following Russia’s annexation of Crimea. The previous year, protests in Ukraine’s capital Kyiv against Ukrainian President Viktor Yanukovych’s decision to reject a deal for greater economic integration with the European Union (EU) were met with a  violent crackdown by state security forces. The protests widened, escalating the conflict, and President Yanukovych fled the country in February 2014."],
      "context_set": ""
    },
    {"tag": "winning",
      "patterns": ["which country is winning the war?"],
      "responses": ["Military analysts ponder whether the Russian army will soon become a spent force — exhausted by heavy casualties, high equipment losses, poor morale, and weak logistics, and incapable of mounting another major offensive operation. The Kremlin’s decision not to declare a full mobilization makes it difficult for the Russian military to replace combat losses. U.S. officials see Russian President Vladimir Putin stubbornly digging in, discern no negotiating path in the near term, and expect a war of attrition, with the sides slugging it out but neither able to score a convincing victory.."],
      "context_set": ""
    },
    {"tag": "updates",
      "patterns": ["any updates on the war?"],
      "responses": ["Russian President Vladimir Putin's special military operation into neighboring Ukraine began on Feb. 24, with Russian forces invading from Belarus, to the north, and Russia, to the east. Ukrainian troops have offered stiff resistance, according to U.S. officials. The Russian military has since launched a full-scale ground offensive in eastern Ukraine's disputed Donbas region, capturing the strategic port city of Mariupol and securing a coastal corridor to the Moscow-annexed Crimean Peninsula."],
      "context_set": ""
    },
    {"tag": "today",
      "patterns": ["what happened today in the war?"],
      "responses": ["As Wednesday draws to a close in Kyiv and in Moscow, here are the key developments of the day: Parts of eastern Ukraine came under constant Russian bombardment. Russia is trying to take full control of the Donbas region that's become the main focus of its war in Ukraine. Fighting escalated especially near the city of Severodonetsk; the Luhansk region's pro-Kyiv governor said on Telegram 15,000 citizens remain in and around the city and Ukrainian forces are still holding out. Ukrainian President Volodymyr Zelenskyy told the World Economic Forum in Davos, Switzerland, that his country refuses to give up any land for an end to the war.Zelenskyy and other Ukrainian officials offered condolences to the community of Uvalde, Texas, where a gunman killed 21 people — including 19 students — at an elementary school. Speaking by video at a conference on the sidelines at Davos, Zelenskyy also drew a link, citing tragic killing of children in both the shooting and the war in Ukraine. Moscow could provide a humanitarian corridor for food shipments out of Ukraine in exchange for lifting of some sanctions, said Russian Deputy Foreign Minister Andrei Rudenko. Ukraine's foreign minister called the offer blackmail. World leaders are warning of a looming global food shortage as Black Sea trade routes remain blocked, trapping Ukrainian exports of wheat, sunflower oil and other foodstuffs."],
      "context_set": ""
    }
  ]
}